//
//  TenGod.swift
//  FortuneTelling
//
//  Created by Hamburger on 2020/7/1.
//  Copyright © 2020 Hamburger. All rights reserved.
//

import Foundation

class TenGod {
    
    static let shared: TenGod = TenGod()
    
    private init() {}
    
    private let heavenData: [String] = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"]
    
    private let tenGodData: [String: [String]] = [
        "甲": ["比", "劫", "ㄗ", "印", "殺", "官", "才", "財", "食", "傷"],
        "乙": ["劫", "比", "印", "ㄗ", "官", "殺", "財", "才", "傷", "食"],
        "丙": ["食", "傷", "比", "劫", "ㄗ", "印", "殺", "官", "才", "財"],
        "丁": ["傷", "食", "劫", "比", "印", "ㄗ", "官", "殺", "財", "才"],
        "戊": ["才", "財", "食", "傷", "比", "劫", "ㄗ", "印", "殺", "官"],
        "己": ["財", "才", "傷", "食", "劫", "比", "印", "ㄗ", "官", "殺"],
        "庚": ["殺", "官", "才", "財", "食", "傷", "比", "劫", "ㄗ", "印"],
        "辛": ["官", "殺", "財", "才", "傷", "食", "劫", "比", "印", "ㄗ"],
        "壬": ["ㄗ", "印", "殺", "官", "才", "財", "食", "傷", "比", "劫"],
        "癸": ["印", "ㄗ", "官", "殺", "財", "才", "傷", "食", "劫", "比"],
        "孖": ["ㄗ", "印", "殺", "官", "才", "財", "食", "傷", "比", "劫"],
        "子": ["ㄗ", "印", "殺", "官", "才", "財", "食", "傷", "比", "劫"],
        "丑": ["財", "才", "傷", "食", "劫", "比", "印", "ㄗ", "官", "殺"],
        "寅": ["比", "劫", "ㄗ", "印", "殺", "官", "才", "財", "食", "傷"],
        "卯": ["劫", "比", "印", "ㄗ", "官", "殺", "財", "才", "傷", "食"],
        "辰": ["才", "財", "食", "傷", "比", "劫", "ㄗ", "印", "殺", "官"],
        "巳": ["傷", "食", "劫", "比", "印", "ㄗ", "官", "殺", "財", "才"],
        "午": ["食", "傷", "比", "劫", "ㄗ", "印", "殺", "官", "才", "財"],
        "未": ["財", "才", "傷", "食", "劫", "比", "印", "ㄗ", "官", "殺"],
        "申": ["殺", "官", "才", "財", "食", "傷", "比", "劫", "ㄗ", "印"],
        "酉": ["官", "殺", "財", "才", "傷", "食", "劫", "比", "印", "ㄗ"],
        "戌": ["才", "財", "食", "傷", "比", "劫", "ㄗ", "印", "殺", "官"],
        "亥": ["印", "ㄗ", "官", "殺", "財", "才", "傷", "食", "劫", "比"]
    ]
    
    func getHourEarthly(birthDayHeaven: String, targetHeavenEarthly: String) -> String {
        
        var order: Int = 0
        
        for index in 0..<heavenData.count where birthDayHeaven == heavenData[index] {
            
            order = index
            
            break
                
        }
        
        guard let hourHeavenEarthlyTable: [String] = tenGodData[targetHeavenEarthly] else { return "查無此值" }
        
        let tenGod: String = hourHeavenEarthlyTable[order]
        
        return tenGod
    }
    
}
